#+Title: Exercise 3.32
The procedures to be run during each time segment of the agenda are kept in a queue. Thus, the procedures for each segment are called in the order in which they were added to the agenda (first in, first out). Explain why this order must be used. In particular, trace the behavior of an and-gate whose inputs change from 0, 1 to 1, 0 in the same segment and say how the behavior would differ if we stored a segment’s procedures in an ordinary list, adding and removing procedures only at the front (last in, first out).

** Tests
#+BEGIN_SRC scheme :session digital-circuit :eval no
  (define input-1 (make-wire))
  (define input-2 (make-wire))
  (define sum (make-wire))
  (define carry (make-wire))

  (probe 'sum sum)
  (probe 'carry carry)

  (half-adder input-1 input-2 sum carry)
  (set-signal! input-1 1)

  (propagate)
#+END_SRC

#+RESULTS:
: sum 5  New-value = 1$5 = done

** AND Gate Tests - FIFO
#+BEGIN_SRC scheme :session digital-circuit :eval no :exports both
  (define input1 (make-wire))

  (define input2 (make-wire))

  (define output (make-wire))

  (probe 'input1 input1)
  (probe 'input2 input2) 
  (probe 'output output)

  (and-gate input1 input2 output)

  (set-signal! input1 0)
  (set-signal! input2 1)

  (propagate)

#+END_SRC

#+RESULTS:
: input1 0  New-value = 0
: input2 0  New-value = 0
: output 0  New-value = 0$2 = ok
: $3 = done
: 
: input2 0  New-value = 1$4 = done
: $5 = done

#+BEGIN_SRC scheme :eval no :exports both
  (set-signal! input1 1)
  (set-signal! input2 0)
  (propagate)
#+END_SRC

#+RESULTS:
: input1 3  New-value = 1$9 = done
: 
: input2 3  New-value = 0$10 = done
: 
: output 6  New-value = 1
: output 6  New-value = 0$11 = done

Here, we don't see the output results after the signal changes since it does not change. It only gets printed when the signal changes.

** AND Gate Tests - LIFO
#+BEGIN_SRC scheme :session digital-circuit :eval no :exports both
  (define input1 (make-wire))

  (define input2 (make-wire))

  (define output (make-wire))

  (probe 'input1 input1)
  (probe 'input2 input2)
  (probe 'output output)

  (and-gate input1 input2 output)

  (set-signal! input1 0)
  (set-signal! input2 1)

  (propagate)

#+END_SRC

#+RESULTS:
: input1 0  New-value = 0
: input2 0  New-value = 0
: output 0  New-value = 0$2 = ok
: $3 = done
: 
: input2 0  New-value = 1$4 = done
: $5 = done

#+BEGIN_SRC scheme :eval no :exports both
  (set-signal! input1 1)
  (set-signal! input2 0)
  (propagate)
#+END_SRC

#+RESULTS:
: input1 3  New-value = 1$6 = done
: 
: input2 3  New-value = 0$7 = done
: 
: output 6  New-value = 1$8 = done

